{
  "cells": [
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "view-in-github",
        "colab_type": "text"
      },
      "source": [
        "<a href=\"https://colab.research.google.com/github/KosteRico/graph-ontology-2022/blob/master/rdf.ipynb\" target=\"_parent\"><img src=\"https://colab.research.google.com/assets/colab-badge.svg\" alt=\"Open In Colab\"/></a>"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "2O_5nRKA0UYM",
        "outputId": "d3183bb9-01df-4d0e-948e-faf5110fd1c5"
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Mounted at /content/drive\n"
          ]
        }
      ],
      "source": [
        "from google.colab import drive\n",
        "drive.mount('/content/drive')"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "PSQbG75_QXVh",
        "outputId": "b6253ced-c276-4b95-b45c-1998964f883e"
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Collecting rdflib\n",
            "  Downloading rdflib-6.1.1-py3-none-any.whl (482 kB)\n",
            "\u001b[?25l\r\u001b[K     |▊                               | 10 kB 22.7 MB/s eta 0:00:01\r\u001b[K     |█▍                              | 20 kB 25.5 MB/s eta 0:00:01\r\u001b[K     |██                              | 30 kB 17.9 MB/s eta 0:00:01\r\u001b[K     |██▊                             | 40 kB 11.9 MB/s eta 0:00:01\r\u001b[K     |███▍                            | 51 kB 4.0 MB/s eta 0:00:01\r\u001b[K     |████                            | 61 kB 4.7 MB/s eta 0:00:01\r\u001b[K     |████▊                           | 71 kB 4.9 MB/s eta 0:00:01\r\u001b[K     |█████▍                          | 81 kB 4.6 MB/s eta 0:00:01\r\u001b[K     |██████                          | 92 kB 5.1 MB/s eta 0:00:01\r\u001b[K     |██████▉                         | 102 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |███████▌                        | 112 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |████████▏                       | 122 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |████████▉                       | 133 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |█████████▌                      | 143 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |██████████▏                     | 153 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |██████████▉                     | 163 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |███████████▌                    | 174 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |████████████▏                   | 184 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |█████████████                   | 194 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |█████████████▋                  | 204 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |██████████████▎                 | 215 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |███████████████                 | 225 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |███████████████▋                | 235 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |████████████████▎               | 245 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |█████████████████               | 256 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |█████████████████▋              | 266 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |██████████████████▎             | 276 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |███████████████████             | 286 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |███████████████████▊            | 296 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |████████████████████▍           | 307 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |█████████████████████           | 317 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |█████████████████████▊          | 327 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |██████████████████████▍         | 337 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |███████████████████████         | 348 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |███████████████████████▊        | 358 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |████████████████████████▍       | 368 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |█████████████████████████▏      | 378 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |█████████████████████████▉      | 389 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |██████████████████████████▌     | 399 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |███████████████████████████▏    | 409 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |███████████████████████████▉    | 419 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |████████████████████████████▌   | 430 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |█████████████████████████████▏  | 440 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |█████████████████████████████▉  | 450 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |██████████████████████████████▌ | 460 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |███████████████████████████████▏| 471 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |████████████████████████████████| 481 kB 4.5 MB/s eta 0:00:01\r\u001b[K     |████████████████████████████████| 482 kB 4.5 MB/s \n",
            "\u001b[?25hRequirement already satisfied: setuptools in /usr/local/lib/python3.7/dist-packages (from rdflib) (57.4.0)\n",
            "Requirement already satisfied: pyparsing in /usr/local/lib/python3.7/dist-packages (from rdflib) (3.0.7)\n",
            "Requirement already satisfied: importlib-metadata in /usr/local/lib/python3.7/dist-packages (from rdflib) (4.11.2)\n",
            "Collecting isodate\n",
            "  Downloading isodate-0.6.1-py2.py3-none-any.whl (41 kB)\n",
            "\u001b[K     |████████████████████████████████| 41 kB 544 kB/s \n",
            "\u001b[?25hRequirement already satisfied: zipp>=0.5 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->rdflib) (3.7.0)\n",
            "Requirement already satisfied: typing-extensions>=3.6.4 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->rdflib) (3.10.0.2)\n",
            "Requirement already satisfied: six in /usr/local/lib/python3.7/dist-packages (from isodate->rdflib) (1.15.0)\n",
            "Installing collected packages: isodate, rdflib\n",
            "Successfully installed isodate-0.6.1 rdflib-6.1.1\n"
          ]
        }
      ],
      "source": [
        "pip install rdflib"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "yk7b8P1lXjxa",
        "outputId": "995c4ab0-a56b-4fc4-9243-738250e322f7"
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "0                     MT6580\n",
            "1         Spreadtrum SC7731E\n",
            "4                    MT6580M\n",
            "6                    MT6580M\n",
            "7                    MT6580M\n",
            "                ...         \n",
            "1102          Snapdragon 855\n",
            "1103          Snapdragon 865\n",
            "1105    Exynos 7 Series 7884\n",
            "1108      Spreadtrum SC9832E\n",
            "1113               Helio P70\n",
            "Name: Модель процессора, Length: 382, dtype: object\n",
            "     Страна-производитель                name  Год релиза  \\\n",
            "0                   Китай         INOI 1 Lite        2018   \n",
            "1                   Китай           DEXP A440        2021   \n",
            "4                   Китай           DEXP G450        2020   \n",
            "6                   Китай       DEXP A350 MIX        2020   \n",
            "7                   Китай           DEXP A250        2020   \n",
            "...                   ...                 ...         ...   \n",
            "1102              Таиланд       Sony Xperia 5        2019   \n",
            "1103              Таиланд    Sony Xperia 5 II        2020   \n",
            "1105              Вьетнам  Samsung Galaxy A10        2019   \n",
            "1108                Китай   Black Fox B9 Fox+        2022   \n",
            "1113                Китай      Doogee S88 Pro        2020   \n",
            "\n",
            "      Поддержка сетей 4G (LTE)  Поддержка сетей 5G  Диагональ экрана (дюйм)  \\\n",
            "0                        False               False                     4.00   \n",
            "1                        False               False                     4.00   \n",
            "4                        False               False                     5.00   \n",
            "6                        False               False                     5.00   \n",
            "7                        False               False                     5.00   \n",
            "...                        ...                 ...                      ...   \n",
            "1102                      True               False                     6.10   \n",
            "1103                      True                True                     6.10   \n",
            "1105                      True               False                     6.20   \n",
            "1108                      True               False                     6.26   \n",
            "1113                      True               False                     6.30   \n",
            "\n",
            "     Разрешение экрана  Плотность пикселей Технология изготовления экрана  \\\n",
            "0              854x480               244.0                             TN   \n",
            "1              800x480               170.0                             TN   \n",
            "4              854x480               196.0                             TN   \n",
            "6              960x480               214.0                             TN   \n",
            "7              960x480               214.0                             TN   \n",
            "...                ...                 ...                            ...   \n",
            "1102         2520x1080               449.0                           OLED   \n",
            "1103         2520x1080               449.0                           OLED   \n",
            "1105          1560x720               277.0                             TN   \n",
            "1108          1520x720               280.0                            IPS   \n",
            "1113         2340x1080               409.0                            IPS   \n",
            "\n",
            "      Частота обновления экрана  ... Поддержка быстрой зарядки  \\\n",
            "0                            60  ...                     False   \n",
            "1                            60  ...                     False   \n",
            "4                            60  ...                     False   \n",
            "6                            60  ...                     False   \n",
            "7                            60  ...                     False   \n",
            "...                         ...  ...                       ...   \n",
            "1102                         60  ...                      True   \n",
            "1103                        120  ...                      True   \n",
            "1105                         60  ...                     False   \n",
            "1108                         60  ...                     False   \n",
            "1113                         60  ...                     False   \n",
            "\n",
            "      Поддержка беспроводной зарядки    Вес  price  \\\n",
            "0                              False  109.0   1999   \n",
            "1                              False  110.3   3199   \n",
            "4                              False  152.0   3199   \n",
            "6                              False    NaN   3799   \n",
            "7                              False    NaN   3899   \n",
            "...                              ...    ...    ...   \n",
            "1102                           False  164.0      0   \n",
            "1103                           False  163.0      0   \n",
            "1105                           False  168.0      0   \n",
            "1108                           False  179.0      0   \n",
            "1113                            True  372.0      0   \n",
            "\n",
            "                                                    url    Бренд  \\\n",
            "0     https://www.dns-shop.ru/product/f2f4a71bff7233...     INOI   \n",
            "1     https://www.dns-shop.ru/product/d5635852337e33...     DEXP   \n",
            "4     https://www.dns-shop.ru/product/86c5d33d078133...     DEXP   \n",
            "6     https://www.dns-shop.ru/product/8d6f8d73df331b...     DEXP   \n",
            "7     https://www.dns-shop.ru/product/5c166317ddcb1b...     DEXP   \n",
            "...                                                 ...      ...   \n",
            "1102  https://www.dns-shop.ru/product/79302cf9ea6f1b...     Sony   \n",
            "1103  https://www.dns-shop.ru/product/33514c1efc6d1b...     Sony   \n",
            "1105  https://www.dns-shop.ru/product/d890139151d61b...  Samsung   \n",
            "1108  https://www.dns-shop.ru/product/c5661df88872ed...    Black   \n",
            "1113  https://www.dns-shop.ru/product/cc375ca9ca3133...   Doogee   \n",
            "\n",
            "      Тип разрешения экрана  Аккумулятор  Класс плотности пикселей  Класс веса  \n",
            "0                       MD+         1000                       Bad       Light  \n",
            "1                       MD+         1440                       Bad       Light  \n",
            "4                       MD+         2000                       Bad       Light  \n",
            "6                       MD+         2500                       Bad       Heavy  \n",
            "7                       MD+         3000                       Bad       Heavy  \n",
            "...                     ...          ...                       ...         ...  \n",
            "1102               Full HD+         3140                     Great       Light  \n",
            "1103               Full HD+         4000                     Great       Light  \n",
            "1105                    HD+         3400                    Normal         Mid  \n",
            "1108                    HD+         4000                    Normal         Mid  \n",
            "1113               Full HD+        10000                     Great       Heavy  \n",
            "\n",
            "[381 rows x 26 columns]\n",
            "Страна-производитель               0\n",
            "name                               0\n",
            "Год релиза                         0\n",
            "Поддержка сетей 4G (LTE)           0\n",
            "Поддержка сетей 5G                 0\n",
            "Диагональ экрана (дюйм)            0\n",
            "Разрешение экрана                  0\n",
            "Плотность пикселей                 0\n",
            "Технология изготовления экрана     0\n",
            "Частота обновления экрана          0\n",
            "Емкость аккумулятора               3\n",
            "Степень защиты IP                  0\n",
            "Модель процессора                  0\n",
            "Объем оперативной памяти           0\n",
            "Объем встроенной памяти            0\n",
            "Стереодинамики                     0\n",
            "Поддержка быстрой зарядки          0\n",
            "Поддержка беспроводной зарядки     0\n",
            "Вес                               33\n",
            "price                              0\n",
            "url                                0\n",
            "Бренд                              0\n",
            "Тип разрешения экрана              0\n",
            "Аккумулятор                        0\n",
            "Класс плотности пикселей           0\n",
            "Класс веса                         0\n",
            "dtype: int64\n",
            "Страна-производитель               object\n",
            "name                               object\n",
            "Год релиза                          int64\n",
            "Поддержка сетей 4G (LTE)             bool\n",
            "Поддержка сетей 5G                   bool\n",
            "Диагональ экрана (дюйм)           float64\n",
            "Разрешение экрана                  object\n",
            "Плотность пикселей                float64\n",
            "Технология изготовления экрана     object\n",
            "Частота обновления экрана           int64\n",
            "Емкость аккумулятора               object\n",
            "Степень защиты IP                    bool\n",
            "Модель процессора                  object\n",
            "Объем оперативной памяти            int64\n",
            "Объем встроенной памяти             int64\n",
            "Стереодинамики                       bool\n",
            "Поддержка быстрой зарядки            bool\n",
            "Поддержка беспроводной зарядки       bool\n",
            "Вес                               float64\n",
            "price                               int64\n",
            "url                                object\n",
            "Бренд                              object\n",
            "Тип разрешения экрана              object\n",
            "Аккумулятор                         int64\n",
            "Класс плотности пикселей           object\n",
            "Класс веса                         object\n",
            "dtype: object\n"
          ]
        }
      ],
      "source": [
        "import pandas as pd\n",
        "df = pd.read_csv(\"/content/drive/MyDrive/smartphones.csv\")\n",
        "df = df[['Страна-производитель','Модель', 'Год релиза', 'Поддержка сетей 4G (LTE)',\n",
        "        'Поддержка сетей 5G', 'Диагональ экрана (дюйм)', 'Разрешение экрана', 'Плотность пикселей',\n",
        "        'Технология изготовления экрана', 'Частота обновления экрана', 'Емкость аккумулятора',\n",
        "        'Степень защиты IP', 'Модель процессора', 'Объем оперативной памяти', 'Объем встроенной памяти',\n",
        "        'Стереодинамики', 'Поддержка быстрой зарядки', 'Поддержка беспроводной зарядки', 'Вес', 'price', 'url']]\n",
        "\n",
        "# drop same models with different colors\n",
        "df.drop_duplicates(subset=['Модель', 'Объем оперативной памяти', 'Объем встроенной памяти'], inplace=True)\n",
        "df['Модель'] = df['Модель'].replace(r' \"Как новый\"', '', regex=True)\n",
        "df.drop_duplicates(subset=['Модель'], inplace=True)\n",
        "df['Бренд'] = df['Модель'].str.split(' ',1).str[0]\n",
        "\n",
        "df['price'] = df['price'].replace(r'\\s+|₽','', regex=True).fillna(0).astype(int)\n",
        "df['Диагональ экрана (дюйм)'] = df['Диагональ экрана (дюйм)'].replace(r'\\s+|\"','', regex=True).astype(float)\n",
        "df['Тип разрешения экрана'] = df['Разрешение экрана'].replace(r'\\d+x|х','', regex=True).astype(int)\n",
        "df['Вес'] = df['Вес'].replace(r'\\s+|г','', regex=True).astype(float)\n",
        "df['Плотность пикселей'] = df['Плотность пикселей'].dropna().replace(r'\\s+|ppi','', regex=True).astype(float)\n",
        "df['Частота обновления экрана'] = df['Частота обновления экрана'].fillna(60).replace(r'\\s+|Гц','', regex=True).astype(int)\n",
        "df['Объем оперативной памяти'] = df[df['Модель']=='Apple iPhone 13 Pro']['Объем оперативной памяти'].fillna(6)\n",
        "df['Объем оперативной памяти'] = df['Объем оперативной памяти'].fillna(4).replace(r'\\s+|МБ|Гб','', regex=True).astype(int)\n",
        "df['Объем встроенной памяти'] = df['Объем встроенной памяти'].replace(r'\\s+|ГБ','', regex=True).astype(int)\n",
        "df['Аккумулятор'] = df['Емкость аккумулятора'].replace(r'\\s+|мА\\*ч','', regex=True).fillna(3000).astype(int)\n",
        "df['Модель процессора'] = df['Модель процессора'].replace(r' MT6(7|8)\\w+($|/s)|MediaTek |Apple |HiSilicon ', '', regex=True).replace(r'888\\+', '888 Plus', regex=True)\n",
        "print(df['Модель процессора'])\n",
        "\n",
        "def dimensClass(x):\n",
        "  if x in range(480, 720):\n",
        "    x = 'MD+'\n",
        "  elif x in range(720, 1080):\n",
        "    x = 'HD+'\n",
        "  elif x in range(1080, 1440):\n",
        "    x = 'Full HD+'\n",
        "  elif x >= 1440:\n",
        "    x = 'WQHD'\n",
        "  return x\n",
        "\n",
        "def isThereFeature(x):\n",
        "  if x not in ['нет']:\n",
        "    x = True\n",
        "  else:\n",
        "    x = False\n",
        "  return x\n",
        "\n",
        "def weightClass(x):\n",
        "  if x <= 165.0:\n",
        "    x = 'Light'\n",
        "  elif x <= 195.0:\n",
        "    x = 'Mid'\n",
        "  else:\n",
        "    x = 'Heavy'\n",
        "  return x\n",
        "\n",
        "def pixelDensityClass(x):\n",
        "  if x < 250:\n",
        "    x = 'Bad'\n",
        "  elif x >= 250 and x < 330:\n",
        "    x = 'Normal'\n",
        "  elif x >= 330 and x < 380:\n",
        "    x = 'Good'\n",
        "  elif x >= 380:\n",
        "    x = 'Great'\n",
        "  return x\n",
        "\n",
        "df = df[df['Модель процессора'].notna()]\n",
        "df = df[df['Объем оперативной памяти'].notna()]\n",
        "\n",
        "df['Страна-производитель'] = df['Страна-производитель'].fillna('Китай')\n",
        "df['Технология изготовления экрана'] = df['Технология изготовления экрана'].fillna('IPS')\n",
        "\n",
        "df['Тип разрешения экрана'] = df['Тип разрешения экрана'].apply(dimensClass)\n",
        "df['Класс плотности пикселей'] = df['Плотность пикселей'].apply(pixelDensityClass)\n",
        "df['Класс веса'] = df['Вес'].apply(weightClass)\n",
        "\n",
        "for col in ['Поддержка сетей 4G (LTE)', 'Поддержка сетей 5G', 'Степень защиты IP',\n",
        "            'Стереодинамики', 'Поддержка быстрой зарядки', 'Поддержка беспроводной зарядки']:\n",
        "  df[col] = df[col].fillna('нет').apply(isThereFeature)\n",
        "\n",
        "df = df.rename(columns={'Модель': 'name'})\n",
        "\n",
        "print(df)\n",
        "print(df.isna().sum())\n",
        "print(df.dtypes)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "m0y__sn4o9A3",
        "outputId": "8b5594f4-dd84-4538-e720-bad7738709e4"
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "      Модель процессора  proc_score proc_mark\n",
            "0            A15 Bionic          97        A+\n",
            "1        Dimensity 9000          95        A+\n",
            "2    Snapdragon 8 Gen 1          94        A+\n",
            "3            A14 Bionic          93        A+\n",
            "4           Exynos 2200          91        A+\n",
            "..                  ...         ...       ...\n",
            "120           Helio P22          22         D\n",
            "121      Snapdragon 450          22         D\n",
            "122           Helio P23          21         D\n",
            "123           Kirin 658          21         D\n",
            "124         Exynos 7880          21         D\n",
            "\n",
            "[125 rows x 3 columns]\n",
            "                    name  autonomy_score\n",
            "0              Realme 6i             113\n",
            "1     Samsung Galaxy M51             105\n",
            "2               Realme 5             103\n",
            "3     Samsung Galaxy A42             102\n",
            "4              Realme 5s             102\n",
            "..                   ...             ...\n",
            "120             Realme 3              74\n",
            "121    Sony Xperia 5 III              73\n",
            "122    OnePlus Nord 2 5G              73\n",
            "123  Asus Zenfone 8 Flip              73\n",
            "124   Samsung Galaxy A52              73\n",
            "\n",
            "[125 rows x 2 columns]\n",
            "    Страна-производитель                   name  Год релиза  \\\n",
            "0                  Китай            INOI 1 Lite        2018   \n",
            "1                  Китай              DEXP A440        2021   \n",
            "2                  Китай              DEXP G450        2020   \n",
            "3                  Китай          DEXP A350 MIX        2020   \n",
            "4                  Китай              DEXP A250        2020   \n",
            "..                   ...                    ...         ...   \n",
            "382              Таиланд          Sony Xperia 5        2019   \n",
            "383              Таиланд       Sony Xperia 5 II        2020   \n",
            "384              Вьетнам     Samsung Galaxy A10        2019   \n",
            "385                Китай  Black Fox B9 Fox Plus        2022   \n",
            "386                Китай         Doogee S88 Pro        2020   \n",
            "\n",
            "     Поддержка сетей 4G (LTE)  Поддержка сетей 5G  Диагональ экрана (дюйм)  \\\n",
            "0                       False               False                     4.00   \n",
            "1                       False               False                     4.00   \n",
            "2                       False               False                     5.00   \n",
            "3                       False               False                     5.00   \n",
            "4                       False               False                     5.00   \n",
            "..                        ...                 ...                      ...   \n",
            "382                      True               False                     6.10   \n",
            "383                      True                True                     6.10   \n",
            "384                      True               False                     6.20   \n",
            "385                      True               False                     6.26   \n",
            "386                      True               False                     6.30   \n",
            "\n",
            "    Разрешение экрана  Плотность пикселей Технология изготовления экрана  \\\n",
            "0             854x480               244.0                             TN   \n",
            "1             800x480               170.0                             TN   \n",
            "2             854x480               196.0                             TN   \n",
            "3             960x480               214.0                             TN   \n",
            "4             960x480               214.0                             TN   \n",
            "..                ...                 ...                            ...   \n",
            "382         2520x1080               449.0                           OLED   \n",
            "383         2520x1080               449.0                           OLED   \n",
            "384          1560x720               277.0                             TN   \n",
            "385          1520x720               280.0                            IPS   \n",
            "386         2340x1080               409.0                            IPS   \n",
            "\n",
            "     Частота обновления экрана  ...    Бренд  Тип разрешения экрана  \\\n",
            "0                           60  ...     INOI                    MD+   \n",
            "1                           60  ...     DEXP                    MD+   \n",
            "2                           60  ...     DEXP                    MD+   \n",
            "3                           60  ...     DEXP                    MD+   \n",
            "4                           60  ...     DEXP                    MD+   \n",
            "..                         ...  ...      ...                    ...   \n",
            "382                         60  ...     Sony               Full HD+   \n",
            "383                        120  ...     Sony               Full HD+   \n",
            "384                         60  ...  Samsung                    HD+   \n",
            "385                         60  ...    Black                    HD+   \n",
            "386                         60  ...   Doogee               Full HD+   \n",
            "\n",
            "    Аккумулятор  Класс плотности пикселей  Класс веса  proc_score  proc_mark  \\\n",
            "0          1000                       Bad       Light         NaN        NaN   \n",
            "1          1440                       Bad       Light         NaN        NaN   \n",
            "2          2000                       Bad       Light         NaN        NaN   \n",
            "3          2500                       Bad       Heavy         NaN        NaN   \n",
            "4          3000                       Bad       Heavy         NaN        NaN   \n",
            "..          ...                       ...         ...         ...        ...   \n",
            "382        3140                     Great       Light        63.0          B   \n",
            "383        4000                     Great       Light        74.0          A   \n",
            "384        3400                    Normal         Mid         NaN        NaN   \n",
            "385        4000                    Normal         Mid         NaN        NaN   \n",
            "386       10000                     Great       Heavy        31.0          C   \n",
            "\n",
            "     autonomy_score  camera_score  camera_rate  \n",
            "0               NaN           NaN          NaN  \n",
            "1               NaN           NaN          NaN  \n",
            "2               NaN           NaN          NaN  \n",
            "3               NaN           NaN          NaN  \n",
            "4               NaN           NaN          NaN  \n",
            "..              ...           ...          ...  \n",
            "382             NaN           NaN          NaN  \n",
            "383            79.0         111.0        116.0  \n",
            "384             NaN           NaN          NaN  \n",
            "385             NaN           NaN          NaN  \n",
            "386             NaN           NaN          NaN  \n",
            "\n",
            "[387 rows x 31 columns]\n",
            "Страна-производитель                0\n",
            "name                                0\n",
            "Год релиза                          0\n",
            "Поддержка сетей 4G (LTE)            0\n",
            "Поддержка сетей 5G                  0\n",
            "Диагональ экрана (дюйм)             0\n",
            "Разрешение экрана                   0\n",
            "Плотность пикселей                  0\n",
            "Технология изготовления экрана      0\n",
            "Частота обновления экрана           0\n",
            "Емкость аккумулятора                6\n",
            "Степень защиты IP                   0\n",
            "Модель процессора                   0\n",
            "Объем оперативной памяти            0\n",
            "Объем встроенной памяти             0\n",
            "Стереодинамики                      0\n",
            "Поддержка быстрой зарядки           0\n",
            "Поддержка беспроводной зарядки      0\n",
            "Вес                                33\n",
            "price                               0\n",
            "url                                 0\n",
            "Бренд                               0\n",
            "Тип разрешения экрана               0\n",
            "Аккумулятор                         0\n",
            "Класс плотности пикселей            0\n",
            "Класс веса                          0\n",
            "proc_score                        118\n",
            "proc_mark                         118\n",
            "autonomy_score                    354\n",
            "camera_score                      359\n",
            "camera_rate                       359\n",
            "dtype: int64\n"
          ]
        }
      ],
      "source": [
        "import pandas as pd\n",
        "df_proc = pd.read_csv(\"/content/drive/MyDrive/processors.csv\")\n",
        "df_proc = df_proc[['name', 'rating_score', 'rating_mark']].rename(columns={'name': 'Модель процессора', 'rating_score': 'proc_score', 'rating_mark': 'proc_mark'})\n",
        "df_auto = pd.read_csv(\"/content/drive/MyDrive/battery.csv\")\n",
        "df_auto = df_auto[['name', 'rating']].rename(columns={'rating': 'autonomy_score'})\n",
        "df_camera = pd.read_csv(\"/content/drive/MyDrive/camera.csv\")\n",
        "df_camera = df_camera[['name', 'camera_score', 'camera_rate']]\n",
        "\n",
        "print(df_proc)\n",
        "df_auto['name'] = df_auto['name'].replace(r'Oppo Rea', 'Rea', regex=True).replace(r'Xiaomi Po', 'Po', regex=True).replace(r' (Snapdragon)', '', regex=True).replace(r'\\+',' Plus',regex=True)\n",
        "df['name'] = df['name'].replace('OPPO', 'Oppo', regex=True).replace(r'HUAWEI', 'Huawei', regex=True).replace(r'Huawei Ho', 'Ho', regex=True).replace(r'\\+',' Plus',regex=True)\n",
        "print(df_auto)\n",
        "df_camera['name'] = df_camera['name']\n",
        "\n",
        "res = df.merge(df_proc, on=[\"Модель процессора\"], how=\"left\")\n",
        "res = res.merge(df_auto, on=[\"name\"], how=\"left\")\n",
        "res = res.merge(df_camera, on=[\"name\"], how=\"left\")\n",
        "print(res)\n",
        "print(res.isna().sum())\n",
        "res['proc_score'] = res['proc_score'].fillna(10)\n",
        "res['proc_mark'] = res['proc_mark'].fillna('D')\n",
        "res['autonomy_score'] = res['autonomy_score'].fillna(10)\n",
        "res['camera_score'] = res['camera_score'].fillna(10)\n",
        "res['camera_rate'] = res['camera_rate'].fillna(1000)\n",
        "#print(res[res['autonomy_score'] > 10])"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "bNrTKifMRVgB"
      },
      "outputs": [],
      "source": [
        "from rdflib import URIRef, BNode, Literal, Namespace, Graph\n",
        "from rdflib.namespace import Namespace, NamespaceManager\n",
        "from rdflib.plugins import sparql\n",
        "from rdflib.namespace import RDF, RDFS, XSD\n",
        "from rdflib.serializer import Serializer\n",
        "\n",
        "# Create a Graph\n",
        "g = Graph()\n",
        "\n",
        "g.parse(\"/content/drive/MyDrive/smart-3-1.owl\")\n",
        "# Create an RDF URI node to use as the subject for multiple triples\n",
        "n = Namespace(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1\")\n",
        "\n",
        "res['name'] = res['name'].replace(r' ', '_', regex=True)\n",
        "res['Страна-производитель'] = res['Страна-производитель'].replace(r', республика| \\(китай\\)', '', regex=True)\n",
        "res['Название процессора'] = res['Модель процессора']\n",
        "res['Модель процессора'] = res['Модель процессора'].replace(r' ', '_', regex=True)\n",
        "res['Технология изготовления экрана'] = res['Технология изготовления экрана'].replace(r' ', '_', regex=True)\n",
        "\n",
        "#Classes\n",
        "Smartphone_class = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#Smartphone\")\n",
        "Country_class = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#Country\")\n",
        "Company_class = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#Company\")\n",
        "Chip_class = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#Chip\")\n",
        "Display_class = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#Display\")\n",
        "\n",
        "#Object properties\n",
        "hasCompany = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#hasCompany\")\n",
        "isCompanyOf = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#isCompanyOf\")\n",
        "hasCountry = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#hasCountry\")\n",
        "isCountryOf = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#isCountryOf\")\n",
        "hasChip = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#hasChip\")\n",
        "isChipOf = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#isChipOf\")\n",
        "hasDisplay = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#hasDisplay\")\n",
        "isDisplayOf = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#isDisplayOf\")\n",
        "\n",
        "#Data properties\n",
        "has4G = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#4G\")\n",
        "has5G = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#5G\")\n",
        "fastCharge = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#fastCharge\")\n",
        "wirelessCharge = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#wirelessCharge\")\n",
        "protection = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#protection\")\n",
        "stereoSound = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#stereoSound\")\n",
        "autonomyScore = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#autonomyScore\")\n",
        "cameraScore = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#cameraScore\")\n",
        "modelName = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#modelName\")\n",
        "price = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#price\")\n",
        "url = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#url\")\n",
        "weight = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#weight\")\n",
        "weightClass = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#weightClass\")\n",
        "year = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#year\")\n",
        "RAM = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#RAM\")\n",
        "ROM = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#ROM\")\n",
        "battery = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#battery\")\n",
        "\n",
        "chipName = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#chipName\")\n",
        "chipClass = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#chipClass\")\n",
        "chipScore = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#chipScore\")\n",
        "\n",
        "diagonal = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#diagonal\")\n",
        "displayType = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#displayType\")\n",
        "density = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#density\")\n",
        "densityRank = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#densityRank\")\n",
        "frequency = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#frequency\")\n",
        "resolution = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#resolution\")\n",
        "resolutionType = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#resolutionType\")\n",
        "\n",
        "companyName = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#companyName\")\n",
        "countryName = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#countryName\")\n",
        "\n",
        "# Add triples using store's add() method.\n",
        "for index, row in res.iterrows():\n",
        "  smartphone = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone#\"+row['name'])\n",
        "  country = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone#\"+row['Страна-производитель'])\n",
        "  company = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone#\"+row['Бренд'])\n",
        "  chip = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone#\"+row['Модель процессора'])\n",
        "  display = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone#\"+row['Технология изготовления экрана']+'_'\n",
        "                    +row['Разрешение экрана'])+'_'+str(row['Диагональ экрана (дюйм)'])+'_'+str(row['Частота обновления экрана'])\n",
        "\n",
        "  #Classes\n",
        "  g.add((smartphone, RDF.type, Smartphone_class))\n",
        "  g.add((country, RDF.type, Country_class))\n",
        "  g.add((company, RDF.type, Company_class))\n",
        "  g.add((chip, RDF.type, Chip_class))\n",
        "  g.add((display, RDF.type, Display_class))\n",
        "  \n",
        "  #Object properties\n",
        "  g.add((smartphone, hasCompany, company))\n",
        "  g.add((company, isCompanyOf, smartphone))\n",
        "  g.add((company, hasCountry, country))\n",
        "  g.add((country, isCountryOf, company))\n",
        "  g.add((smartphone, hasChip, chip))\n",
        "  g.add((chip, isChipOf, smartphone))\n",
        "  g.add((smartphone, hasDisplay, display))\n",
        "  g.add((display, isDisplayOf, smartphone))\n",
        "\n",
        "  #Data properties\n",
        "  g.add((smartphone, has4G, Literal(row['Поддержка сетей 4G (LTE)'], datatype=XSD.boolean)))\n",
        "  g.add((smartphone, has5G, Literal(row['Поддержка сетей 5G'], datatype=XSD.boolean)))\n",
        "  g.add((smartphone, fastCharge, Literal(row['Поддержка быстрой зарядки'], datatype=XSD.boolean)))\n",
        "  g.add((smartphone, wirelessCharge, Literal(row['Поддержка беспроводной зарядки'], datatype=XSD.boolean)))\n",
        "  g.add((smartphone, protection, Literal(row['Степень защиты IP'], datatype=XSD.boolean)))\n",
        "  g.add((smartphone, stereoSound, Literal(row['Стереодинамики'], datatype=XSD.boolean)))\n",
        "  g.add((smartphone, autonomyScore, Literal(row['autonomy_score'], datatype=XSD.integer)))\n",
        "  g.add((smartphone, cameraScore, Literal(row['camera_score'], datatype=XSD.integer)))\n",
        "  g.add((smartphone, modelName, Literal(row['name'])))\n",
        "  g.add((smartphone, price, Literal(row['price'], datatype=XSD.integer)))\n",
        "  g.add((smartphone, url, Literal(row['url'])))\n",
        "  g.add((smartphone, weight, Literal(row['Вес'], datatype=XSD.float)))\n",
        "  g.add((smartphone, weightClass, Literal(row['Класс веса'])))\n",
        "  g.add((smartphone, year, Literal(row['Год релиза'], datatype=XSD.integer)))\n",
        "  g.add((smartphone, RAM, Literal(row['Объем оперативной памяти'], datatype=XSD.integer)))\n",
        "  g.add((smartphone, ROM, Literal(row['Объем встроенной памяти'], datatype=XSD.integer)))\n",
        "  g.add((smartphone, battery, Literal(row['Аккумулятор'], datatype=XSD.integer)))\n",
        "  g.add((chip, chipName, Literal(row['Название процессора'])))\n",
        "  g.add((chip, chipClass, Literal(row['proc_mark'])))\n",
        "  g.add((chip, chipScore, Literal(row['proc_score'], datatype=XSD.integer)))\n",
        "  g.add((company, companyName, Literal(row['Бренд'])))\n",
        "  g.add((country, countryName, Literal(row['Страна-производитель'])))\n",
        "  g.add((display, diagonal, Literal(row['Диагональ экрана (дюйм)'], datatype=XSD.float)))\n",
        "  g.add((display, displayType, Literal(row['Технология изготовления экрана'])))\n",
        "  g.add((display, frequency, Literal(row['Частота обновления экрана'], datatype=XSD.integer)))\n",
        "  g.add((display, resolution, Literal(row['Разрешение экрана'])))\n",
        "  g.add((display, resolutionType, Literal(row['Тип разрешения экрана'])))\n",
        "  g.add((display, density, Literal(row['Плотность пикселей'], datatype=XSD.integer)))\n",
        "  g.add((display, densityRank, Literal(row['Класс плотности пикселей'])))\n",
        "\n",
        "# Add another person\n",
        "#ed = URIRef(\"http://example.org/edward\")\n",
        "#name = URIRef(\"http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1/\" + 'model')\n",
        "\n",
        "res.to_csv(\"/content/drive/MyDrive/sm.csv\")\n",
        "g.serialize(destination=\"/content/drive/MyDrive/smart-3-2.rdf\", format='application/rdf+xml')"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "RM9cbJ06lUEF",
        "outputId": "42544484-9796-4019-b1be-d6b89310d574"
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Collecting owlrl\n",
            "  Downloading owlrl-6.0.2-py3-none-any.whl (54 kB)\n",
            "\u001b[?25l\r\u001b[K     |██████                          | 10 kB 21.5 MB/s eta 0:00:01\r\u001b[K     |████████████                    | 20 kB 9.8 MB/s eta 0:00:01\r\u001b[K     |██████████████████              | 30 kB 8.4 MB/s eta 0:00:01\r\u001b[K     |████████████████████████        | 40 kB 7.8 MB/s eta 0:00:01\r\u001b[K     |██████████████████████████████  | 51 kB 7.1 MB/s eta 0:00:01\r\u001b[K     |████████████████████████████████| 54 kB 2.4 MB/s \n",
            "\u001b[?25hRequirement already satisfied: rdflib>=6.0.2 in /usr/local/lib/python3.7/dist-packages (from owlrl) (6.1.1)\n",
            "Requirement already satisfied: pyparsing in /usr/local/lib/python3.7/dist-packages (from rdflib>=6.0.2->owlrl) (3.0.7)\n",
            "Requirement already satisfied: setuptools in /usr/local/lib/python3.7/dist-packages (from rdflib>=6.0.2->owlrl) (57.4.0)\n",
            "Requirement already satisfied: isodate in /usr/local/lib/python3.7/dist-packages (from rdflib>=6.0.2->owlrl) (0.6.1)\n",
            "Requirement already satisfied: importlib-metadata in /usr/local/lib/python3.7/dist-packages (from rdflib>=6.0.2->owlrl) (4.11.2)\n",
            "Requirement already satisfied: zipp>=0.5 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->rdflib>=6.0.2->owlrl) (3.7.0)\n",
            "Requirement already satisfied: typing-extensions>=3.6.4 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->rdflib>=6.0.2->owlrl) (3.10.0.2)\n",
            "Requirement already satisfied: six in /usr/local/lib/python3.7/dist-packages (from isodate->rdflib>=6.0.2->owlrl) (1.15.0)\n",
            "Installing collected packages: owlrl\n",
            "Successfully installed owlrl-6.0.2\n"
          ]
        }
      ],
      "source": [
        "!pip install owlrl"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "FyZoHqiAnC8S",
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "outputId": "5eb5741e-c814-4b2d-c819-952b3fb42104"
      },
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "<Graph identifier=N110516b0849c4c9ba02546b50e9546cb (<class 'rdflib.graph.Graph'>)>"
            ]
          },
          "metadata": {},
          "execution_count": 9
        }
      ],
      "source": [
        "from rdflib import URIRef, BNode, Literal, Namespace, Graph\n",
        "\n",
        "g = Graph()\n",
        "\n",
        "# Parse in an RDF file hosted on the Internet\n",
        "g.parse(\"/content/drive/MyDrive/smart.owl\", format='n3')"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "qFQM812kl2uz",
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "outputId": "1935ddc0-69eb-4969-e348-c83c5f9fae19"
      },
      "outputs": [
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "['\\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\\nPREFIX owl: <http://www.w3.org/2002/07/owl#>\\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\\nPREFIX smt: <http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#>\\n\\nSELECT ?subject\\n    WHERE { ?subject rdf:type smt:ForBlogging ;\\n                     smt:price ?price ;\\n                     smt:5G ?5g ;\\n                 FILTER ( ?price > 50000 && ?5g = true )\\n\\n     }\\n',\n",
              " '\\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\\nPREFIX owl: <http://www.w3.org/2002/07/owl#>\\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\\nPREFIX smt: <http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#>\\n\\nSELECT ?subject\\n    WHERE { ?subject rdf:type smt:ForGaming ;\\n                     rdf:type smt:GoodAutonomy\\n     }\\n',\n",
              " '\\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\\nPREFIX owl: <http://www.w3.org/2002/07/owl#>\\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\\nPREFIX smt: <http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#>\\n\\nSELECT ?subject\\n    WHERE { ?subject rdf:type smt:ForGaming ;\\n                     smt:price ?price .\\n                 FILTER ( ?price < 30000 )\\n     }\\n',\n",
              " '\\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\\nPREFIX owl: <http://www.w3.org/2002/07/owl#>\\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\\nPREFIX smt: <http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#>\\n\\nSELECT ?subject\\n    WHERE { ?subject rdf:type smt:ForFun ;\\n                     smt:price ?price ;\\n                     smt:hasCompany ?company .\\n            ?company smt:companyName ?companyName\\n                 FILTER ( ?companyName = \"OPPO\" && ?price < 30000 )\\n     }\\n',\n",
              " '\\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\\nPREFIX owl: <http://www.w3.org/2002/07/owl#>\\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\\nPREFIX smt: <http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#>\\n\\nSELECT DISTINCT ?subject\\n    WHERE { ?subject rdf:type smt:ForStudy ;\\n                     smt:hasCompany ?company .\\n            ?company smt:hasCountry ?country .\\n                 FILTER ( regex(str(?country), \".*#Китай\"))\\n     }\\n',\n",
              " '\\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\\nPREFIX owl: <http://www.w3.org/2002/07/owl#>\\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\\nPREFIX smt: <http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#>\\n\\nSELECT ?subject\\n    WHERE { ?subject  rdf:type smt:Compact ;\\n                      rdf:type smt:GreatPerfomance .\\n     }\\n',\n",
              " '\\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\\nPREFIX owl: <http://www.w3.org/2002/07/owl#>\\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\\nPREFIX smt: <http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#>\\n\\nSELECT ?subject ?price\\n    WHERE { ?subject  rdf:type smt:GreatAutonomy ;\\n                      smt:price ?price ;\\n                      smt:hasDisplay ?display .\\n            ?display smt:resolutionType ?resType .\\n            FILTER ( ?resType = \"WQHD\" )\\n      } ORDER BY ASC (?price)\\n',\n",
              " '\\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\\nPREFIX owl: <http://www.w3.org/2002/07/owl#>\\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\\nPREFIX smt: <http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#>\\n\\nSELECT ?subject\\n    WHERE { ?subject  rdf:type smt:ForFun ;\\n                      smt:year ?year .\\n            FILTER ( ?year > 2020 )\\n      }\\n',\n",
              " '\\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\\nPREFIX owl: <http://www.w3.org/2002/07/owl#>\\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\\nPREFIX smt: <http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#>\\n\\nSELECT ?subject\\n    WHERE { ?subject   rdf:type smt:ForElderly ;\\n                       rdf:type smt:ForStudy .\\n    }\\n',\n",
              " '\\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\\nPREFIX owl: <http://www.w3.org/2002/07/owl#>\\nPREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\\nPREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\\nPREFIX smt: <http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#>\\n\\nSELECT (COUNT(*) as ?cnt) WHERE { ?s ?p ?o }\\n']"
            ]
          },
          "metadata": {},
          "execution_count": 10
        }
      ],
      "source": [
        "prefixes = \"\"\"\n",
        "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
        "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
        "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
        "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
        "PREFIX smt: <http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#>\n",
        "\"\"\"\n",
        "\n",
        "queries = [\n",
        "\"\"\"\n",
        "SELECT ?subject\n",
        "    WHERE { ?subject rdf:type smt:ForBlogging ;\n",
        "                     smt:price ?price ;\n",
        "                     smt:5G ?5g ;\n",
        "                 FILTER ( ?price > 50000 && ?5g = true )\n",
        "\n",
        "     }\n",
        "\"\"\",\n",
        "\"\"\"\n",
        "SELECT ?subject\n",
        "    WHERE { ?subject rdf:type smt:ForGaming ;\n",
        "                     rdf:type smt:GoodAutonomy\n",
        "     }\n",
        "\"\"\",\n",
        "\"\"\"\n",
        "SELECT ?subject\n",
        "    WHERE { ?subject rdf:type smt:ForGaming ;\n",
        "                     smt:price ?price .\n",
        "                 FILTER ( ?price < 30000 )\n",
        "     }\n",
        "\"\"\",\n",
        "\"\"\"\n",
        "SELECT ?subject\n",
        "    WHERE { ?subject rdf:type smt:ForFun ;\n",
        "                     smt:price ?price ;\n",
        "                     smt:hasCompany ?company .\n",
        "            ?company smt:companyName ?companyName\n",
        "                 FILTER ( ?companyName = \"OPPO\" && ?price < 30000 )\n",
        "     }\n",
        "\"\"\",\n",
        "\"\"\"\n",
        "SELECT DISTINCT ?subject\n",
        "    WHERE { ?subject rdf:type smt:ForStudy ;\n",
        "                     smt:hasCompany ?company .\n",
        "            ?company smt:hasCountry ?country .\n",
        "                 FILTER ( regex(str(?country), \".*#Китай\"))\n",
        "     }\n",
        "\"\"\",\n",
        "\"\"\"\n",
        "SELECT ?subject\n",
        "    WHERE { ?subject  rdf:type smt:Compact ;\n",
        "                      rdf:type smt:GreatPerfomance .\n",
        "     }\n",
        "\"\"\",\n",
        "\"\"\"\n",
        "SELECT ?subject ?price\n",
        "    WHERE { ?subject  rdf:type smt:GreatAutonomy ;\n",
        "                      smt:price ?price ;\n",
        "                      smt:hasDisplay ?display .\n",
        "            ?display smt:resolutionType ?resType .\n",
        "            FILTER ( ?resType = \"WQHD\" )\n",
        "      } ORDER BY ASC (?price)\n",
        "\"\"\",\n",
        "\"\"\"\n",
        "SELECT ?subject\n",
        "    WHERE { ?subject  rdf:type smt:ForFun ;\n",
        "                      smt:year ?year .\n",
        "            FILTER ( ?year > 2020 )\n",
        "      }\n",
        "\"\"\",\n",
        "\"\"\"\n",
        "SELECT ?subject\n",
        "    WHERE { ?subject   rdf:type smt:ForElderly ;\n",
        "                       rdf:type smt:ForStudy .\n",
        "    }\n",
        "\"\"\",\n",
        "\"\"\"\n",
        "SELECT (COUNT(*) as ?cnt) WHERE { ?s ?p ?o }\n",
        "\"\"\"\n",
        "]\n",
        "\n",
        "queries = [prefixes + q for q in queries]\n",
        "queries"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "-LYs17bifUlc",
        "outputId": "6bd3759d-8e44-4dcd-d393-073f7234bf98"
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "SPARQL query \"\n",
            "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
            "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
            "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
            "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
            "PREFIX smt: <http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#>\n",
            "\n",
            "SELECT ?subject\n",
            "    WHERE { ?subject rdf:type smt:ForBlogging ;\n",
            "                     smt:price ?price ;\n",
            "                     smt:5G ?5g ;\n",
            "                 FILTER ( ?price > 50000 && ?5g = true )\n",
            "\n",
            "     }\n",
            "\"\n",
            "\n",
            "RESULT:\n",
            "\n",
            "--------------------------------------------------\n",
            "\n",
            "SPARQL query \"\n",
            "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
            "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
            "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
            "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
            "PREFIX smt: <http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#>\n",
            "\n",
            "SELECT ?subject\n",
            "    WHERE { ?subject rdf:type smt:ForGaming ;\n",
            "                     rdf:type smt:GoodAutonomy\n",
            "     }\n",
            "\"\n",
            "\n",
            "RESULT:\n",
            "\n",
            "--------------------------------------------------\n",
            "\n",
            "SPARQL query \"\n",
            "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
            "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
            "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
            "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
            "PREFIX smt: <http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#>\n",
            "\n",
            "SELECT ?subject\n",
            "    WHERE { ?subject rdf:type smt:ForGaming ;\n",
            "                     smt:price ?price .\n",
            "                 FILTER ( ?price < 30000 )\n",
            "     }\n",
            "\"\n",
            "\n",
            "RESULT:\n",
            "\n",
            "--------------------------------------------------\n",
            "\n",
            "SPARQL query \"\n",
            "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
            "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
            "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
            "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
            "PREFIX smt: <http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#>\n",
            "\n",
            "SELECT ?subject\n",
            "    WHERE { ?subject rdf:type smt:ForFun ;\n",
            "                     smt:price ?price ;\n",
            "                     smt:hasCompany ?company .\n",
            "            ?company smt:companyName ?companyName\n",
            "                 FILTER ( ?companyName = \"OPPO\" && ?price < 30000 )\n",
            "     }\n",
            "\"\n",
            "\n",
            "RESULT:\n",
            "\n",
            "--------------------------------------------------\n",
            "\n",
            "SPARQL query \"\n",
            "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
            "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
            "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
            "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
            "PREFIX smt: <http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#>\n",
            "\n",
            "SELECT DISTINCT ?subject\n",
            "    WHERE { ?subject rdf:type smt:ForStudy ;\n",
            "                     smt:hasCompany ?company .\n",
            "            ?company smt:hasCountry ?country .\n",
            "                 FILTER ( regex(str(?country), \".*#Китай\"))\n",
            "     }\n",
            "\"\n",
            "\n",
            "RESULT:\n",
            "\n",
            "--------------------------------------------------\n",
            "\n",
            "SPARQL query \"\n",
            "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
            "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
            "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
            "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
            "PREFIX smt: <http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#>\n",
            "\n",
            "SELECT ?subject\n",
            "    WHERE { ?subject  rdf:type smt:Compact ;\n",
            "                      rdf:type smt:GreatPerfomance .\n",
            "     }\n",
            "\"\n",
            "\n",
            "RESULT:\n",
            "\n",
            "--------------------------------------------------\n",
            "\n",
            "SPARQL query \"\n",
            "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
            "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
            "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
            "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
            "PREFIX smt: <http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#>\n",
            "\n",
            "SELECT ?subject ?price\n",
            "    WHERE { ?subject  rdf:type smt:GreatAutonomy ;\n",
            "                      smt:price ?price ;\n",
            "                      smt:hasDisplay ?display .\n",
            "            ?display smt:resolutionType ?resType .\n",
            "            FILTER ( ?resType = \"WQHD\" )\n",
            "      } ORDER BY ASC (?price)\n",
            "\"\n",
            "\n",
            "RESULT:\n",
            "\n",
            "--------------------------------------------------\n",
            "\n",
            "SPARQL query \"\n",
            "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
            "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
            "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
            "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
            "PREFIX smt: <http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#>\n",
            "\n",
            "SELECT ?subject\n",
            "    WHERE { ?subject  rdf:type smt:ForFun ;\n",
            "                      smt:year ?year .\n",
            "            FILTER ( ?year > 2020 )\n",
            "      }\n",
            "\"\n",
            "\n",
            "RESULT:\n",
            "\n",
            "--------------------------------------------------\n",
            "\n",
            "SPARQL query \"\n",
            "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
            "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
            "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
            "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
            "PREFIX smt: <http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#>\n",
            "\n",
            "SELECT ?subject\n",
            "    WHERE { ?subject   rdf:type smt:ForElderly ;\n",
            "                       rdf:type smt:ForStudy .\n",
            "    }\n",
            "\"\n",
            "\n",
            "RESULT:\n",
            "\n",
            "--------------------------------------------------\n",
            "\n",
            "SPARQL query \"\n",
            "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
            "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
            "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
            "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
            "PREFIX smt: <http://www.semanticweb.org/eugene/ontologies/2022/1/smartphone-1#>\n",
            "\n",
            "SELECT (COUNT(*) as ?cnt) WHERE { ?s ?p ?o }\n",
            "\"\n",
            "\n",
            "RESULT:\n",
            "(rdflib.term.Literal('13052', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')),)\n",
            "\n",
            "--------------------------------------------------\n",
            "\n"
          ]
        }
      ],
      "source": [
        "\n",
        "for q in queries:\n",
        "  qres = g.query(q)\n",
        "\n",
        "  print(f'SPARQL query \"{q}\"\\n')\n",
        "\n",
        "  print('RESULT:')\n",
        "  for row in qres:\n",
        "    print(str(row))\n",
        "\n",
        "  print('\\n' + '-'*50 + '\\n')\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "id": "lcrXXWv8mBJf"
      },
      "outputs": [],
      "source": [
        ""
      ]
    }
  ],
  "metadata": {
    "colab": {
      "collapsed_sections": [],
      "name": "rdf.ipynb",
      "provenance": [],
      "include_colab_link": true
    },
    "kernelspec": {
      "display_name": "Python 3",
      "name": "python3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "nbformat": 4,
  "nbformat_minor": 0
}