{"nbformat":4,"nbformat_minor":0,"metadata":{"colab":{"provenance":[],"authorship_tag":"ABX9TyMpRfEyIsNtzDV9qI9w9nEP"},"kernelspec":{"name":"python3","display_name":"Python 3"},"language_info":{"name":"python"}},"cells":[{"cell_type":"code","execution_count":1,"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"FRxk0DevxHun","executionInfo":{"status":"ok","timestamp":1672331035144,"user_tz":-480,"elapsed":4073,"user":{"displayName":"Константин Окладников","userId":"05322508951268007401"}},"outputId":"0391cab4-9315-4178-cd25-93825176e28a"},"outputs":[{"output_type":"stream","name":"stdout","text":["Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/\n","Collecting rdflib\n","  Downloading rdflib-6.2.0-py3-none-any.whl (500 kB)\n","\u001b[K     |████████████████████████████████| 500 kB 31.5 MB/s \n","\u001b[?25hRequirement already satisfied: pyparsing in /usr/local/lib/python3.8/dist-packages (from rdflib) (3.0.9)\n","Requirement already satisfied: setuptools in /usr/local/lib/python3.8/dist-packages (from rdflib) (57.4.0)\n","Collecting isodate\n","  Downloading isodate-0.6.1-py2.py3-none-any.whl (41 kB)\n","\u001b[K     |████████████████████████████████| 41 kB 672 kB/s \n","\u001b[?25hRequirement already satisfied: six in /usr/local/lib/python3.8/dist-packages (from isodate->rdflib) (1.15.0)\n","Installing collected packages: isodate, rdflib\n","Successfully installed isodate-0.6.1 rdflib-6.2.0\n"]}],"source":["!pip install rdflib"]},{"cell_type":"code","source":["from google.colab import drive\n","\n","from rdflib import Graph, Literal, BNode, Namespace, URIRef\n","from rdflib.namespace import XSD, RDF, OWL, RDFS, VOID\n","\n","drive.mount('/content/gdrive')\n","\n","ontology_url = 'gdrive/My Drive/Colab Notebooks/OntologiesRepresentationKnowledge/filled-tanks-ontology.owl'"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"YN4VZ8H_xbnx","executionInfo":{"status":"ok","timestamp":1672331054461,"user_tz":-480,"elapsed":19325,"user":{"displayName":"Константин Окладников","userId":"05322508951268007401"}},"outputId":"dbc34a26-ab92-43e7-e484-3b62e8f04589"},"execution_count":2,"outputs":[{"output_type":"stream","name":"stdout","text":["Mounted at /content/gdrive\n"]}]},{"cell_type":"code","source":["# Create a Graph\n","tanks_ontology_graph = Graph()\n","\n","# Parse in an RDF file\n","tanks_ontology_graph.parse(ontology_url, format=\"turtle\")\n","\n","print(len(tanks_ontology_graph))"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"yqaMujV-x62m","executionInfo":{"status":"ok","timestamp":1672331359131,"user_tz":-480,"elapsed":304676,"user":{"displayName":"Константин Окладников","userId":"05322508951268007401"}},"outputId":"e5a6ea30-ff09-416d-f615-4b271ddd494e"},"execution_count":3,"outputs":[{"output_type":"stream","name":"stdout","text":["4595028\n"]}]},{"cell_type":"code","source":["# 1. Сколько игроков в бою превысили свои средние показатели по урону на используемом танке?\n","player_success_query = \"\"\"\n","  PREFIX : <http://www.semanticweb.org/ko4ebhuk/ontologies/2022/10/tanks#>\n","  PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n","  SELECT (COUNT(?player) as ?superiorPlayers) WHERE {\n","    ?battleResults a :BattleResults .\n","    ?battleResults :isResultsOfPlayer ?player .\n","    ?battleResults :playedOn ?tank .\n","    ?battleResults :batResDamage ?damageInBattle .\n","    ?playerStatOnTank :tankStatisticOf ?player .\n","    ?playerStatOnTank :tankStatisticOn ?tank .\n","    ?playerStatOnTank :concreteTankDamageDealt ?damageDealt .\n","    ?playerStatOnTank :concreteTankBattles ?battlesOnTank .\n","    FILTER (xsd:float(?damageInBattle) > ?damageDealt/?battlesOnTank)\n","  }\n","\"\"\"\n","\n","for row in tanks_ontology_graph.query(player_success_query):\n","    print(f\"{row.superiorPlayers} of players surpassed themselves\")"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"ysDvAk5FEazl","executionInfo":{"status":"ok","timestamp":1672331359526,"user_tz":-480,"elapsed":402,"user":{"displayName":"Константин Окладников","userId":"05322508951268007401"}},"outputId":"0de2dc2a-b916-4841-f952-59d32645ed8e"},"execution_count":4,"outputs":[{"output_type":"stream","name":"stdout","text":["85 of players surpassed themselves\n"]}]},{"cell_type":"code","source":["# 2. Какой из танков, представленных в бою, имеется у наибольшего числа игроков в статистике?\n","most_popular_tank_query = \"\"\"\n","  PREFIX : <http://www.semanticweb.org/ko4ebhuk/ontologies/2022/10/tanks#>\n","  PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n","  SELECT (COUNT(?tankName) as ?count) WHERE {\n","    ?battleResults a :BattleResults .\n","    ?battleResults :isResultsOfPlayer ?player .\n","    ?battleResults :playedOn ?tank .\n","    ?tank :vechicleName ?tankName .\n","  }\n","\"\"\"\n","\n","for row in tanks_ontology_graph.query(most_popular_tank_query):\n","    print(f\"count {row.count}\")"],"metadata":{"id":"ajMul1HBEdwY","executionInfo":{"status":"ok","timestamp":1672334619742,"user_tz":-480,"elapsed":309,"user":{"displayName":"Константин Окладников","userId":"05322508951268007401"}},"colab":{"base_uri":"https://localhost:8080/"},"outputId":"3745c0d3-563b-4cac-a834-5597f7d49722"},"execution_count":51,"outputs":[{"output_type":"stream","name":"stdout","text":["count <built-in method count of ResultRow object at 0x7ff177af5440>\n"]}]},{"cell_type":"code","source":["# 3. Какой самый популярный тип техники по сумме сыгранных боёв среди игроков?\n","most_playable_tank_query = \"\"\"\n","  PREFIX : <http://www.semanticweb.org/ko4ebhuk/ontologies/2022/10/tanks#>\n","  PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n","  SELECT ?tankType (SUM(?totalBattles) AS ?totalSum) WHERE {\n","    ?statistic a :PlayerStatisticOnConcreteTank .\n","    ?statistic :tankStatisticOn ?tank .\n","    ?tank :hasType ?tankType .\n","    ?statistic :concreteTankBattles ?totalBattles .\n","  }\n","  GROUP BY ?tankType\n","  ORDER BY DESC(?totalSum)\n","  LIMIT 1\n","\"\"\"\n","\n","for row in tanks_ontology_graph.query(most_playable_tank_query):\n","    print(f\"tankType {row.tankType} totalSum {row.totalSum}\")"],"metadata":{"id":"1Rz4JvfKEgHm","executionInfo":{"status":"ok","timestamp":1672335390531,"user_tz":-480,"elapsed":11690,"user":{"displayName":"Константин Окладников","userId":"05322508951268007401"}},"colab":{"base_uri":"https://localhost:8080/"},"outputId":"631f4f8a-05c0-4fd4-a061-cbe333a95402"},"execution_count":63,"outputs":[{"output_type":"stream","name":"stdout","text":["tankType http://www.semanticweb.org/ko4ebhuk/ontologies/2022/10/tanks#heavyTank totalSum 10737643\n"]}]},{"cell_type":"code","source":["# 4. Тяжелые танки какой нации наименее результативны?\n","nation_of_worst_heavy_tank_query = \"\"\"\n","  PREFIX : <http://www.semanticweb.org/ko4ebhuk/ontologies/2022/10/tanks#>\n","  PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n","  SELECT ?nation (AVG(xsd:float(?wins)/xsd:float(?battles)) AS ?avgWinPercen) WHERE {\n","    ?tank a :Tank.\n","    ?tank :hasType :heavyTank .\n","    ?tank :hasNation ?nation .\n","    ?statistic :tankStatisticOn ?tank .\n","    ?statistic :concreteTankWins ?wins .\n","    ?statistic :concreteTankBattles ?battles .\n","  }\n","  GROUP BY ?nation\n","  ORDER BY DESC(?avgWinPercen)\n","  LIMIT 1\n","\"\"\"\n","\n","for row in tanks_ontology_graph.query(nation_of_worst_heavy_tank_query):\n","    print(f\"nation {row.nation} avgWinPercen {row.avgWinPercen}\")"],"metadata":{"id":"muUgISAtEjyR","executionInfo":{"status":"ok","timestamp":1672333648931,"user_tz":-480,"elapsed":9516,"user":{"displayName":"Константин Окладников","userId":"05322508951268007401"}},"colab":{"base_uri":"https://localhost:8080/"},"outputId":"01ab27de-0bad-4a3f-d035-ed35884519b9"},"execution_count":38,"outputs":[{"output_type":"stream","name":"stdout","text":["nation http://www.semanticweb.org/ko4ebhuk/ontologies/2022/10/tanks#china avgWinPercen 0.5108836515555025\n"]}]},{"cell_type":"code","source":["# 5. Кто повалил больше всего деревьев в среднем за бой?\n","max_treesCut_query = \"\"\"\n","  PREFIX : <http://www.semanticweb.org/ko4ebhuk/ontologies/2022/10/tanks#>\n","  PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n","  SELECT ?name (xsd:float(?treesCut)/xsd:float(?battlesCount) AS ?result) WHERE {\n","    ?player a :Player .\n","    ?player :nickName ?name .\n","    ?player :hasStatistic ?statistic .\n","    ?statistic :treesCut ?treesCut .\n","    ?statistic :battles ?battlesCount .\n","  }\n","  ORDER BY DESC(?result)\n","  LIMIT 1\n","\"\"\"\n","\n","for row in tanks_ontology_graph.query(max_treesCut_query):\n","    print(f\"{row.name} avg_cuts {row.result}\")"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"PouRAgW70Vu8","executionInfo":{"status":"ok","timestamp":1672331359528,"user_tz":-480,"elapsed":11,"user":{"displayName":"Константин Окладников","userId":"05322508951268007401"}},"outputId":"85e85e20-cff3-4576-934a-84f66fff10e6"},"execution_count":8,"outputs":[{"output_type":"stream","name":"stdout","text":["15_MunyT_ADA avg_cuts 3.426887094707164\n"]}]},{"cell_type":"code","source":["# VoID\n","from rdflib.void import generateVoID\n","\n","void = generateVoID(tanks_ontology_graph)"],"metadata":{"id":"eM2KZZW6-fMB","executionInfo":{"status":"ok","timestamp":1672335853231,"user_tz":-480,"elapsed":61933,"user":{"displayName":"Константин Окладников","userId":"05322508951268007401"}}},"execution_count":64,"outputs":[]},{"cell_type":"code","source":["void[0].serialize(destination=\"status.owl\")"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"678d2-0B-8EY","executionInfo":{"status":"ok","timestamp":1672335915334,"user_tz":-480,"elapsed":323,"user":{"displayName":"Константин Окладников","userId":"05322508951268007401"}},"outputId":"bc0adcd8-e31b-4a90-ae9f-543363ce1e1d"},"execution_count":66,"outputs":[{"output_type":"execute_result","data":{"text/plain":["<Graph identifier=N4502729e99d0419cb0965ec21373b490 (<class 'rdflib.graph.Graph'>)>"]},"metadata":{},"execution_count":66}]}]}